In [1]:
import pandas as pd

In [11]:
df = pd.read_excel('Student_ List.xlsx')
df

    Sr No      USN       Name  Lab Experiment allotted
0       1  PUCS001    ABIGAIL                      NaN
1       2  PUCS002  ALEXANDRA                      NaN
2       3  PUCS003     ALISON                      NaN
3       4  PUCS004     AMANDA                      NaN
4       5  PUCS006     AMELIA                      NaN
..    ...      ...        ...                      ...
81     82  PUCS085   VIRGINIA                      NaN
82     83  PUCS086      WANDA                      NaN
83     84  PUCS087      WENDY                      NaN
84     85  PUCS088     YVONNE                      NaN
85     86  PUCS089        ZOE                      NaN

[86 rows x 4 columns]

In [13]:
df.isna().sum()

Sr No                       0
USN                         0
Name                        0
Lab Experiment allotted    86
dtype: int64

In [14]:
df['USN'].count()

86

In [15]:
import random
a=[]
for j in range(df['USN'].count()):
    a.append(random.randint(1,15))

In [16]:
df["Lab Experiment allotted"]=a
df

    Sr No      USN       Name  Lab Experiment allotted
0       1  PUCS001    ABIGAIL                       13
1       2  PUCS002  ALEXANDRA                        5
2       3  PUCS003     ALISON                       15
3       4  PUCS004     AMANDA                        3
4       5  PUCS006     AMELIA                       14
..    ...      ...        ...                      ...
81     82  PUCS085   VIRGINIA                        5
82     83  PUCS086      WANDA                       13
83     84  PUCS087      WENDY                        6
84     85  PUCS088     YVONNE                        2
85     86  PUCS089        ZOE                        4

[86 rows x 4 columns]

In [22]:
df.to_excel('alloted.xlsx')